id: bde132ed-3ea8-4036-86be-8cedef5tgqq
name: Risky user (Entra ID Protection)
type: Microsoft.OperationalInsights/workspaces/providers/alertRules
kind: Scheduled
properties:
  displayName: Risky user (Entra ID Protection)
  description: >-
    This detection alerts for users where Entra ID Protection has deemed either:
      - The sign-in as risky with a risk level of medium or high
      - The aggregated risk as high.

    More information on Microsoft Entra ID Protection risks can be found here: https://learn.microsoft.com/en-us/entra/id-protection/concept-identity-protection-risks
  severity: Medium
  enabled: true
  status: Available
  requiredDataConnectors:
    - connectorId: AzureActiveDirectoryIdentityProtection
      dataTypes:
        - SecurityAlert (IPC)
  queryFrequency: PT1H
  queryPeriod: PT1H
  triggerOperator: GreaterThan
  triggerThreshold: 0
  tactics:
    - InitialAccess
  techniques:
    - T1078
  query: >-
    SigninLogs
    | where ResultType == "0"
    | where RiskState in ('atRisk', 'confirmedCompromised')
    | where RiskLevelDuringSignIn in ('medium','high') or RiskLevelAggregated == 'high'
    | where UserPrincipalName !contains "uniflow"
    | project-reorder TimeGenerated, UserPrincipalName, RiskDetail, RiskEventTypes, RiskState, RiskLevelDuringSignIn, RiskLevelAggregated, DeviceDetail, IPAddress
  alertRuleTemplateName: null
  entityMappings:
    - entityType: Account
      fieldMappings:
        - identifier: FullName
          columnName: UserPrincipalName
  templateVersion: null
